fenix0xf/ek-tm4c1294xl/src/drv/tivaware/inc/hw_epi.h
//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_STAT register.
//
//*****************************************************************************
#define EPI_STAT_XFFULL       0x00000100 // External FIFO Full
#define EPI_STAT_XFEMPTY      0x00000080 // External FIFO Empty
#define EPI_STAT_INITSEQ      0x00000040 // Initialization Sequence
#define EPI_STAT_WBUSY        0x00000020 // Write Busy
#define EPI_STAT_NBRBUSY      0x00000010 // Non-Blocking Read Busy
#define EPI_STAT_ACTIVE       0x00000001 // Register Active

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_RFIFOCNT register.
//
//*****************************************************************************
#define EPI_RFIFOCNT_COUNT_M  0x0000000F // FIFO Count
#define EPI_RFIFOCNT_COUNT_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_READFIFO0
// register.
//
//*****************************************************************************
#define EPI_READFIFO0_DATA_M  0xFFFFFFFF // Reads Data
#define EPI_READFIFO0_DATA_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_READFIFO1
// register.
//
//*****************************************************************************
#define EPI_READFIFO1_DATA_M  0xFFFFFFFF // Reads Data
#define EPI_READFIFO1_DATA_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_READFIFO2
// register.
//
//*****************************************************************************
#define EPI_READFIFO2_DATA_M  0xFFFFFFFF // Reads Data
#define EPI_READFIFO2_DATA_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_READFIFO3
// register.
//
//*****************************************************************************
#define EPI_READFIFO3_DATA_M  0xFFFFFFFF // Reads Data
#define EPI_READFIFO3_DATA_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_READFIFO4
// register.
//
//*****************************************************************************
#define EPI_READFIFO4_DATA_M  0xFFFFFFFF // Reads Data
#define EPI_READFIFO4_DATA_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_READFIFO5
// register.
//
//*****************************************************************************
#define EPI_READFIFO5_DATA_M  0xFFFFFFFF // Reads Data
#define EPI_READFIFO5_DATA_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_READFIFO6
// register.
//
//*****************************************************************************
#define EPI_READFIFO6_DATA_M  0xFFFFFFFF // Reads Data
#define EPI_READFIFO6_DATA_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_READFIFO7
// register.
//
//*****************************************************************************
#define EPI_READFIFO7_DATA_M  0xFFFFFFFF // Reads Data
#define EPI_READFIFO7_DATA_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_FIFOLVL register.
//
//*****************************************************************************
#define EPI_FIFOLVL_WFERR     0x00020000 // Write Full Error
#define EPI_FIFOLVL_RSERR     0x00010000 // Read Stall Error
#define EPI_FIFOLVL_WRFIFO_M  0x00000070 // Write FIFO
#define EPI_FIFOLVL_WRFIFO_EMPT \
    0x00000000 // Interrupt is triggered while
               // WRFIFO is empty.
#define EPI_FIFOLVL_WRFIFO_2 \
    0x00000020 // Interrupt is triggered until
               // there are only two slots
               // available. Thus, trigger is
               // deasserted when there are two
               // WRFIFO entries present. This
               // configuration is optimized for
               // bursts of 2
#define EPI_FIFOLVL_WRFIFO_1 \
    0x00000030 // Interrupt is triggered until
               // there is one WRFIFO entry
               // available. This configuration
               // expects only single writes
#define EPI_FIFOLVL_WRFIFO_NFULL \
    0x00000040                             // Trigger interrupt when WRFIFO is
                                           // not full, meaning trigger will
                                           // continue to assert until there
                                           // are four entries in the WRFIFO
#define EPI_FIFOLVL_RDFIFO_M    0x00000007 // Read FIFO
#define EPI_FIFOLVL_RDFIFO_EMPT 0x00000000 // Empty
#define EPI_FIFOLVL_RDFIFO_1 \
    0x00000001 // Trigger when there are 1 or more
               // entries in the NBRFIFO
#define EPI_FIFOLVL_RDFIFO_2 \
    0x00000002 // Trigger when there are 2 or more
               // entries in the NBRFIFO
#define EPI_FIFOLVL_RDFIFO_4 \
    0x00000003 // Trigger when there are 4 or more
               // entries in the NBRFIFO
#define EPI_FIFOLVL_RDFIFO_6 \
    0x00000004 // Trigger when there are 6 or more
               // entries in the NBRFIFO
#define EPI_FIFOLVL_RDFIFO_7 \
    0x00000005 // Trigger when there are 7 or more
               // entries in the NBRFIFO
#define EPI_FIFOLVL_RDFIFO_8 \
    0x00000006 // Trigger when there are 8 entries
               // in the NBRFIFO

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_WFIFOCNT register.
//
//*****************************************************************************
#define EPI_WFIFOCNT_WTAV_M  0x00000007 // Available Write Transactions
#define EPI_WFIFOCNT_WTAV_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_DMATXCNT register.
//
//*****************************************************************************
#define EPI_DMATXCNT_TXCNT_M 0x0000FFFF // DMA Count
#define EPI_DMATXCNT_TXCNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_IM register.
//
//*****************************************************************************
#define EPI_IM_DMAWRIM       0x00000010 // Write uDMA Interrupt Mask
#define EPI_IM_DMARDIM       0x00000008 // Read uDMA Interrupt Mask
#define EPI_IM_WRIM          0x00000004 // Write FIFO Empty Interrupt Mask
#define EPI_IM_RDIM          0x00000002 // Read FIFO Full Interrupt Mask
#define EPI_IM_ERRIM         0x00000001 // Error Interrupt Mask

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_RIS register.
//
//*****************************************************************************
#define EPI_RIS_DMAWRRIS     0x00000010 // Write uDMA Raw Interrupt Status
#define EPI_RIS_DMARDRIS     0x00000008 // Read uDMA Raw Interrupt Status
#define EPI_RIS_WRRIS        0x00000004 // Write Raw Interrupt Status
#define EPI_RIS_RDRIS        0x00000002 // Read Raw Interrupt Status
#define EPI_RIS_ERRRIS       0x00000001 // Error Raw Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_MIS register.
//
//*****************************************************************************
#define EPI_MIS_DMAWRMIS \
    0x00000010 // Write uDMA Masked Interrupt
               // Status
#define EPI_MIS_DMARDMIS \
    0x00000008                            // Read uDMA Masked Interrupt
                                          // Status
#define EPI_MIS_WRMIS          0x00000004 // Write Masked Interrupt Status
#define EPI_MIS_RDMIS          0x00000002 // Read Masked Interrupt Status
#define EPI_MIS_ERRMIS         0x00000001 // Error Masked Interrupt Status

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_EISC register.
//
//*****************************************************************************
#define EPI_EISC_DMAWRIC       0x00000010 // Write uDMA Interrupt Clear
#define EPI_EISC_DMARDIC       0x00000008 // Read uDMA Interrupt Clear
#define EPI_EISC_WTFULL        0x00000004 // Write FIFO Full Error
#define EPI_EISC_RSTALL        0x00000002 // Read Stalled Error
#define EPI_EISC_TOUT          0x00000001 // Timeout Error

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_HB8CFG3 register.
//
//*****************************************************************************
#define EPI_HB8CFG3_WRHIGH     0x00200000 // CS2n WRITE Strobe Polarity
#define EPI_HB8CFG3_RDHIGH     0x00100000 // CS2n READ Strobe Polarity
#define EPI_HB8CFG3_ALEHIGH    0x00080000 // CS2n ALE Strobe Polarity
#define EPI_HB8CFG3_WRWS_M     0x000000C0 // CS2n Write Wait States
#define EPI_HB8CFG3_WRWS_2     0x00000000 // Active WRn is 2 EPI clocks
#define EPI_HB8CFG3_WRWS_4     0x00000040 // Active WRn is 4 EPI clocks
#define EPI_HB8CFG3_WRWS_6     0x00000080 // Active WRn is 6 EPI clocks
#define EPI_HB8CFG3_WRWS_8     0x000000C0 // Active WRn is 8 EPI clocks
#define EPI_HB8CFG3_RDWS_M     0x00000030 // CS2n Read Wait States
#define EPI_HB8CFG3_RDWS_2     0x00000000 // Active RDn is 2 EPI clocks
#define EPI_HB8CFG3_RDWS_4     0x00000010 // Active RDn is 4 EPI clocks
#define EPI_HB8CFG3_RDWS_6     0x00000020 // Active RDn is 6 EPI clocks
#define EPI_HB8CFG3_RDWS_8     0x00000030 // Active RDn is 8 EPI clocks
#define EPI_HB8CFG3_MODE_M     0x00000003 // CS2n Host Bus Sub-Mode
#define EPI_HB8CFG3_MODE_ADMUX 0x00000000 // ADMUX - AD[7:0]
#define EPI_HB8CFG3_MODE_AD    0x00000001 // ADNONMUX - D[7:0]

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_HB16CFG3 register.
//
//*****************************************************************************
#define EPI_HB16CFG3_WRHIGH    0x00200000 // CS2n WRITE Strobe Polarity
#define EPI_HB16CFG3_RDHIGH    0x00100000 // CS2n READ Strobe Polarity
#define EPI_HB16CFG3_ALEHIGH   0x00080000 // CS2n ALE Strobe Polarity
#define EPI_HB16CFG3_WRCRE \
    0x00040000 // CS2n PSRAM Configuration
               // Register Write
#define EPI_HB16CFG3_RDCRE \
    0x00020000                             // CS2n PSRAM Configuration
                                           // Register Read
#define EPI_HB16CFG3_BURST      0x00010000 // CS2n Burst Mode
#define EPI_HB16CFG3_WRWS_M     0x000000C0 // CS2n Write Wait States
#define EPI_HB16CFG3_WRWS_2     0x00000000 // Active WRn is 2 EPI clocks
#define EPI_HB16CFG3_WRWS_4     0x00000040 // Active WRn is 4 EPI clocks
#define EPI_HB16CFG3_WRWS_6     0x00000080 // Active WRn is 6 EPI clocks
#define EPI_HB16CFG3_WRWS_8     0x000000C0 // Active WRn is 8 EPI clocks
#define EPI_HB16CFG3_RDWS_M     0x00000030 // CS2n Read Wait States
#define EPI_HB16CFG3_RDWS_2     0x00000000 // Active RDn is 2 EPI clocks
#define EPI_HB16CFG3_RDWS_4     0x00000010 // Active RDn is 4 EPI clocks
#define EPI_HB16CFG3_RDWS_6     0x00000020 // Active RDn is 6 EPI clocks
#define EPI_HB16CFG3_RDWS_8     0x00000030 // Active RDn is 8 EPI clocks
#define EPI_HB16CFG3_MODE_M     0x00000003 // CS2n Host Bus Sub-Mode
#define EPI_HB16CFG3_MODE_ADMUX 0x00000000 // ADMUX - AD[15:0]
#define EPI_HB16CFG3_MODE_AD    0x00000001 // ADNONMUX - D[15:0]

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_HB16CFG4 register.
//
//*****************************************************************************
#define EPI_HB16CFG4_WRHIGH     0x00200000 // CS3n WRITE Strobe Polarity
#define EPI_HB16CFG4_RDHIGH     0x00100000 // CS3n READ Strobe Polarity
#define EPI_HB16CFG4_ALEHIGH    0x00080000 // CS3n ALE Strobe Polarity
#define EPI_HB16CFG4_WRCRE \
    0x00040000 // CS3n PSRAM Configuration
               // Register Write
#define EPI_HB16CFG4_RDCRE \
    0x00020000                             // CS3n PSRAM Configuration
                                           // Register Read
#define EPI_HB16CFG4_BURST      0x00010000 // CS3n Burst Mode
#define EPI_HB16CFG4_WRWS_M     0x000000C0 // CS3n Write Wait States
#define EPI_HB16CFG4_WRWS_2     0x00000000 // Active WRn is 2 EPI clocks
#define EPI_HB16CFG4_WRWS_4     0x00000040 // Active WRn is 4 EPI clocks
#define EPI_HB16CFG4_WRWS_6     0x00000080 // Active WRn is 6 EPI clocks
#define EPI_HB16CFG4_WRWS_8     0x000000C0 // Active WRn is 8 EPI clocks
#define EPI_HB16CFG4_RDWS_M     0x00000030 // CS3n Read Wait States
#define EPI_HB16CFG4_RDWS_2     0x00000000 // Active RDn is 2 EPI clocks
#define EPI_HB16CFG4_RDWS_4     0x00000010 // Active RDn is 4 EPI clocks
#define EPI_HB16CFG4_RDWS_6     0x00000020 // Active RDn is 6 EPI clocks
#define EPI_HB16CFG4_RDWS_8     0x00000030 // Active RDn is 8 EPI clocks
#define EPI_HB16CFG4_MODE_M     0x00000003 // CS3n Host Bus Sub-Mode
#define EPI_HB16CFG4_MODE_ADMUX 0x00000000 // ADMUX - AD[15:0]
#define EPI_HB16CFG4_MODE_AD    0x00000001 // ADNONMUX - D[15:0]

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_HB8CFG4 register.
//
//*****************************************************************************
#define EPI_HB8CFG4_WRHIGH      0x00200000 // CS3n WRITE Strobe Polarity
#define EPI_HB8CFG4_RDHIGH      0x00100000 // CS2n READ Strobe Polarity
#define EPI_HB8CFG4_ALEHIGH     0x00080000 // CS3n ALE Strobe Polarity
#define EPI_HB8CFG4_WRWS_M      0x000000C0 // CS3n Write Wait States
#define EPI_HB8CFG4_WRWS_2      0x00000000 // Active WRn is 2 EPI clocks
#define EPI_HB8CFG4_WRWS_4      0x00000040 // Active WRn is 4 EPI clocks
#define EPI_HB8CFG4_WRWS_6      0x00000080 // Active WRn is 6 EPI clocks
#define EPI_HB8CFG4_WRWS_8      0x000000C0 // Active WRn is 8 EPI clocks
#define EPI_HB8CFG4_RDWS_M      0x00000030 // CS3n Read Wait States
#define EPI_HB8CFG4_RDWS_2      0x00000000 // Active RDn is 2 EPI clocks
#define EPI_HB8CFG4_RDWS_4      0x00000010 // Active RDn is 4 EPI clocks
#define EPI_HB8CFG4_RDWS_6      0x00000020 // Active RDn is 6 EPI clocks
#define EPI_HB8CFG4_RDWS_8      0x00000030 // Active RDn is 8 EPI clocks
#define EPI_HB8CFG4_MODE_M      0x00000003 // CS3n Host Bus Sub-Mode
#define EPI_HB8CFG4_MODE_ADMUX  0x00000000 // ADMUX - AD[7:0]
#define EPI_HB8CFG4_MODE_AD     0x00000001 // ADNONMUX - D[7:0]

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_HB8TIME register.
//
//*****************************************************************************
#define EPI_HB8TIME_IRDYDLY_M   0x03000000 // CS0n Input Ready Delay
#define EPI_HB8TIME_CAPWIDTH_M \
    0x00003000                               // CS0n Inter-transfer Capture
                                             // Width
#define EPI_HB8TIME_WRWSM         0x00000010 // Write Wait State Minus One
#define EPI_HB8TIME_RDWSM         0x00000001 // Read Wait State Minus One
#define EPI_HB8TIME_IRDYDLY_S     24
#define EPI_HB8TIME_CAPWIDTH_S    12

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_HB16TIME register.
//
//*****************************************************************************
#define EPI_HB16TIME_IRDYDLY_M    0x03000000 // CS0n Input Ready Delay
#define EPI_HB16TIME_PSRAMSZ_M    0x00070000 // PSRAM Row Size
#define EPI_HB16TIME_PSRAMSZ_0    0x00000000 // No row size limitation
#define EPI_HB16TIME_PSRAMSZ_128B 0x00010000 // 128 B
#define EPI_HB16TIME_PSRAMSZ_256B 0x00020000 // 256 B
#define EPI_HB16TIME_PSRAMSZ_512B 0x00030000 // 512 B
#define EPI_HB16TIME_PSRAMSZ_1KB  0x00040000 // 1024 B
#define EPI_HB16TIME_PSRAMSZ_2KB  0x00050000 // 2048 B
#define EPI_HB16TIME_PSRAMSZ_4KB  0x00060000 // 4096 B
#define EPI_HB16TIME_PSRAMSZ_8KB  0x00070000 // 8192 B
#define EPI_HB16TIME_CAPWIDTH_M \
    0x00003000                             // CS0n Inter-transfer Capture
                                           // Width
#define EPI_HB16TIME_WRWSM      0x00000010 // Write Wait State Minus One
#define EPI_HB16TIME_RDWSM      0x00000001 // Read Wait State Minus One
#define EPI_HB16TIME_IRDYDLY_S  24
#define EPI_HB16TIME_CAPWIDTH_S 12

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_HB8TIME2 register.
//
//*****************************************************************************
#define EPI_HB8TIME2_IRDYDLY_M  0x03000000 // CS1n Input Ready Delay
#define EPI_HB8TIME2_CAPWIDTH_M \
    0x00003000                                // CS1n Inter-transfer Capture
                                              // Width
#define EPI_HB8TIME2_WRWSM         0x00000010 // CS1n Write Wait State Minus One
#define EPI_HB8TIME2_RDWSM         0x00000001 // CS1n Read Wait State Minus One
#define EPI_HB8TIME2_IRDYDLY_S     24
#define EPI_HB8TIME2_CAPWIDTH_S    12

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_HB16TIME2
// register.
//
//*****************************************************************************
#define EPI_HB16TIME2_IRDYDLY_M    0x03000000 // CS1n Input Ready Delay
#define EPI_HB16TIME2_PSRAMSZ_M    0x00070000 // PSRAM Row Size
#define EPI_HB16TIME2_PSRAMSZ_0    0x00000000 // No row size limitation
#define EPI_HB16TIME2_PSRAMSZ_128B 0x00010000 // 128 B
#define EPI_HB16TIME2_PSRAMSZ_256B 0x00020000 // 256 B
#define EPI_HB16TIME2_PSRAMSZ_512B 0x00030000 // 512 B
#define EPI_HB16TIME2_PSRAMSZ_1KB  0x00040000 // 1024 B
#define EPI_HB16TIME2_PSRAMSZ_2KB  0x00050000 // 2048 B
#define EPI_HB16TIME2_PSRAMSZ_4KB  0x00060000 // 4096 B
#define EPI_HB16TIME2_PSRAMSZ_8KB  0x00070000 // 8192 B
#define EPI_HB16TIME2_CAPWIDTH_M \
    0x00003000                                // CS1n Inter-transfer Capture
                                              // Width
#define EPI_HB16TIME2_WRWSM        0x00000010 // CS1n Write Wait State Minus One
#define EPI_HB16TIME2_RDWSM        0x00000001 // CS1n Read Wait State Minus One
#define EPI_HB16TIME2_IRDYDLY_S    24
#define EPI_HB16TIME2_CAPWIDTH_S   12

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_HB16TIME3
// register.
//
//*****************************************************************************
#define EPI_HB16TIME3_IRDYDLY_M    0x03000000 // CS2n Input Ready Delay
#define EPI_HB16TIME3_PSRAMSZ_M    0x00070000 // PSRAM Row Size
#define EPI_HB16TIME3_PSRAMSZ_0    0x00000000 // No row size limitation
#define EPI_HB16TIME3_PSRAMSZ_128B 0x00010000 // 128 B
#define EPI_HB16TIME3_PSRAMSZ_256B 0x00020000 // 256 B
#define EPI_HB16TIME3_PSRAMSZ_512B 0x00030000 // 512 B
#define EPI_HB16TIME3_PSRAMSZ_1KB  0x00040000 // 1024 B
#define EPI_HB16TIME3_PSRAMSZ_2KB  0x00050000 // 2048 B
#define EPI_HB16TIME3_PSRAMSZ_4KB  0x00060000 // 4096 B
#define EPI_HB16TIME3_PSRAMSZ_8KB  0x00070000 // 8192 B
#define EPI_HB16TIME3_CAPWIDTH_M \
    0x00003000                              // CS2n Inter-transfer Capture
                                            // Width
#define EPI_HB16TIME3_WRWSM      0x00000010 // CS2n Write Wait State Minus One
#define EPI_HB16TIME3_RDWSM      0x00000001 // CS2n Read Wait State Minus One
#define EPI_HB16TIME3_IRDYDLY_S  24
#define EPI_HB16TIME3_CAPWIDTH_S 12

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_HB8TIME3 register.
//
//*****************************************************************************
#define EPI_HB8TIME3_IRDYDLY_M   0x03000000 // CS2n Input Ready Delay
#define EPI_HB8TIME3_CAPWIDTH_M \
    0x00003000                             // CS2n Inter-transfer Capture
                                           // Width
#define EPI_HB8TIME3_WRWSM      0x00000010 // CS2n Write Wait State Minus One
#define EPI_HB8TIME3_RDWSM      0x00000001 // CS2n Read Wait State Minus One
#define EPI_HB8TIME3_IRDYDLY_S  24
#define EPI_HB8TIME3_CAPWIDTH_S 12

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_HB8TIME4 register.
//
//*****************************************************************************
#define EPI_HB8TIME4_IRDYDLY_M  0x03000000 // CS3n Input Ready Delay
#define EPI_HB8TIME4_CAPWIDTH_M \
    0x00003000                                // CS3n Inter-transfer Capture
                                              // Width
#define EPI_HB8TIME4_WRWSM         0x00000010 // CS3n Write Wait State Minus One
#define EPI_HB8TIME4_RDWSM         0x00000001 // CS3n Read Wait State Minus One
#define EPI_HB8TIME4_IRDYDLY_S     24
#define EPI_HB8TIME4_CAPWIDTH_S    12

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_HB16TIME4
// register.
//
//*****************************************************************************
#define EPI_HB16TIME4_IRDYDLY_M    0x03000000 // CS3n Input Ready Delay
#define EPI_HB16TIME4_PSRAMSZ_M    0x00070000 // PSRAM Row Size
#define EPI_HB16TIME4_PSRAMSZ_0    0x00000000 // No row size limitation
#define EPI_HB16TIME4_PSRAMSZ_128B 0x00010000 // 128 B
#define EPI_HB16TIME4_PSRAMSZ_256B 0x00020000 // 256 B
#define EPI_HB16TIME4_PSRAMSZ_512B 0x00030000 // 512 B
#define EPI_HB16TIME4_PSRAMSZ_1KB  0x00040000 // 1024 B
#define EPI_HB16TIME4_PSRAMSZ_2KB  0x00050000 // 2048 B
#define EPI_HB16TIME4_PSRAMSZ_4KB  0x00060000 // 4096 B
#define EPI_HB16TIME4_PSRAMSZ_8KB  0x00070000 // 8192 B
#define EPI_HB16TIME4_CAPWIDTH_M \
    0x00003000                              // CS3n Inter-transfer Capture
                                            // Width
#define EPI_HB16TIME4_WRWSM      0x00000010 // CS3n Write Wait State Minus One
#define EPI_HB16TIME4_RDWSM      0x00000001 // CS3n Read Wait State Minus One
#define EPI_HB16TIME4_IRDYDLY_S  24
#define EPI_HB16TIME4_CAPWIDTH_S 12

//*****************************************************************************
//
// The following are defines for the bit fields in the EPI_O_HBPSRAM register.
//
//*****************************************************************************
#define EPI_HBPSRAM_CR_M         0x001FFFFF // PSRAM Config Register
#define EPI_HBPSRAM_CR_S         0

//*****************************************************************************
//
// The following definitions are deprecated.
//
//*****************************************************************************
#ifndef DEPRECATED

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the EPI_O_FIFOLVL
// register.
//
//*****************************************************************************
#define EPI_FIFOLVL_WRFIFO_1_4 \
    0x00000020 // Trigger when there are up to 3
               // spaces available in the WFIFO
#define EPI_FIFOLVL_WRFIFO_1_2 \
    0x00000030 // Trigger when there are up to 2
               // spaces available in the WFIFO
#define EPI_FIFOLVL_WRFIFO_3_4 \
    0x00000040 // Trigger when there is 1 space
               // available in the WFIFO
#define EPI_FIFOLVL_RDFIFO_1_8 \
    0x00000001 // Trigger when there are 1 or more
               // entries in the NBRFIFO
#define EPI_FIFOLVL_RDFIFO_1_4 \
    0x00000002 // Trigger when there are 2 or more
               // entries in the NBRFIFO
#define EPI_FIFOLVL_RDFIFO_1_2 \
    0x00000003 // Trigger when there are 4 or more
               // entries in the NBRFIFO
#define EPI_FIFOLVL_RDFIFO_3_4 \
    0x00000004 // Trigger when there are 6 or more
               // entries in the NBRFIFO
#define EPI_FIFOLVL_RDFIFO_7_8 \
    0x00000005 // Trigger when there are 7 or more
               // entries in the NBRFIFO
#define EPI_FIFOLVL_RDFIFO_FULL \
    0x00000006 // Trigger when there are 8 entries
               // in the NBRFIFO

#endif

#endif // __HW_EPI_H__
